function setup() {
	createCanvas(windowWidth, windowHeight);
	background(255);
}

function draw() {
	background(0);
	translate((width - 800) / 2, (height - 1200) / 2);
	
	fill(230);
  noStroke();
	rect(10, 9,780, 1182);

	//body
	fill(141);
	noStroke();
	ellipse(327 + 211 / 2, 626 + 211 / 2, 211, 211);

	fill(87);
	ellipse(328 + 211 / 2, 563 + 211 / 2, 211, 211);

	fill(0);
	ellipse(327 + 211 / 2, 489 + 211 / 2, 211, 211);

	//tail
	fill(87);
	noStroke();
	arc(342 + 182 / 2, 810 + 182 / 2, 182, 182, 0, PI);

	arc(323 + 40, 1051 + 40, 80, 80, PI / 2, PI);
	arc(466 + 40, 1051 + 40, 80, 80, 0, PI / 2);

	fill(64);
	arc(359 + 147 / 2, 891 + 147 / 2, 147, 147, 0, PI);

	arc(419 + 50, 1041 + 50, 100, 100, 0, PI / 2);
	arc(350 + 50, 1041 + 50, 100, 100, PI / 2, PI);

	fill(27);
	arc(370 + 120 / 2, 960 + 120 / 2, 120, 120, 0, PI);
	arc(383 + 50, 1041 + 50, 100, 100, 0, PI);

	// title
	fill(0);
	noStroke();
	rect(92, 100, 75, 85);
	rect(92 + 75 + 15, 100, 75, 85);
	rect(92 + 75 + 15 + 75 + 15, 100, 75, 85);
	rect(92 + 75 * 3 + 15 * 3, 100, 75, 85);
	rect(92 + 75 * 4 + 15 * 4, 100, 75, 85);
	rect(92 + 75 * 5 + 15 * 5, 100, 75, 85);
	rect(92 + 75 * 6 + 15 * 6, 100, 75, 85);

	fill(255);
	rect(120, 100, 47, 71); //L
	rect(207, 113, 38, 58); //O
	rect(293, 113, 43, 21); //B
	rect(293, 153, 43, 21); //B
	rect(382, 113, 55, 21); //S
	rect(362, 152, 55, 21); //S
	rect(452, 113, 29, 72); //T
	rect(498, 113, 29, 72); //T
	rect(578, 113, 39, 13); //E
	rect(578, 134, 39, 35); //E
	rect(658, 113, 37, 29); //R

	triangle(658, 156, 658, 185, 695, 185);

	//lobster
	fill(49, 49, 49);
	noStroke();
	arc(45 + 100, 500 + 100, 200, 200, PI * 3 / 2, PI);
	arc(566 + 100, 300 + 100, 200, 200, 0, PI * 3 / 2);

	//더듬이
	stroke(0);
	strokeWeight(15);
	strokeCap(SQUARE);

	//straight lines
	line(382, 390, 382, 384 + 75);
	line(442, 380, 442, 384 + 75);

	//diagonal
	line(120, 261, 120 + 235, 261 + 110);
	line(460, 234 + 135, 437 + 141, 234);

}